def number_to_words(n):
    odin = {
        1: "один",
        2: "два",
        3: "три",
        4: "четыре",
        5: "пять",
        6: "шесть",
        7: "семь",
        8: "восемь",
        9: "девять",
    }
    mnogo = {
        10: "десять",
        11: "одиннадцать",
        12: "двенадцать",
        13: "тринадцать",
        14: "четырнадцать",
        15: "пятнадцать",
        16: "шестнадцать",
        17: "семнадцать",
        18: "восемнадцать",
        19: "девятнадцать",
    }
    des = {
        20: "двадцать",
        30: "тридцать",
        40: "сорок",
        50: "пятьдесят",
        60: "шестьдесят",
        70: "семьдесят",
        80: "восемьдесят",
        90: "девяносто",
    }

    if 1 <= n <= 9:
        return odin[n]
    elif 10 <= n <= 19:
        return mnogo[n]
    elif 20 <= n <= 99:
        a = (n // 10) * 10
        b = n % 10
        if b == 0:
            return des[a]
        else:
            return des[a] + " " + odin[b]
    else:
        return "Не знаю такое число!"
